offshorewindpark_VentusFlow/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2212                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=64;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// ************************************************************************* //

dimensions      [ 0 2 -1 0 0 0 0 ];
internalField   uniform 1e-08;
boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            atmNutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        z0              uniform 0.05;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;
    }
    side1
    {
        type            cyclic;
    }
    side2
    {
        type            cyclic;
    }
}
// ************************************************************************* //
