offshorewindpark_VentusFlow/constant/NREL15MW_Blade/NREL15MW_foil/DU21_A17
//DU21 airfoil with an aspect ratio of 17.  Original -180 to 180deg Cl, Cd, and Cm versus AOA data taken from Appendix A of DOWEC document 10046_009.pdf (numerical values obtained from Koert Lindenburg of ECN).
//Cl and Cd values corrected for rotational stall delay and Cd values corrected using the Viterna method for 0 to 90deg AOA by Jason Jonkman using AirfoilPrep_v2p0.xls.				
//	AOA	Cl	Cd	
(  -180    0.0000    0.0185  )
(  -175    0.3940    0.0332  )
(  -170    0.7880    0.0945  )
(  -160    0.6700    0.2809  )
(  -155    0.7490    0.3932  )
(  -150    0.7970    0.5112  )
(  -145    0.8180    0.6309  )
(  -140    0.8130    0.7485  )
(  -135    0.7860    0.8612  )
(  -130    0.7390    0.9665  )
(  -125    0.6750    1.0625  )
(  -120    0.5960    1.1476  )
(  -115    0.5050    1.2206  )
(  -110    0.4030    1.2805  )
(  -105    0.2940    1.3265  )
(  -100    0.1790    1.3582  )
(   -95    0.0600    1.3752  )
(   -90   -0.0600    1.3774  )
(   -85   -0.1790    1.3648  )
(   -80   -0.2950    1.3376  )
(   -75   -0.4070    1.2962  )
(   -70   -0.5120    1.2409  )
(   -65   -0.6080    1.1725  )
(   -60   -0.6930    1.0919  )
(   -55   -0.7640    1.0002  )
(   -50   -0.8200    0.8990  )
(   -45   -0.8570    0.7900  )
(   -40   -0.8750    0.6754  )
(   -35   -0.8690    0.5579  )
(   -30   -0.8380    0.4405  )
(   -25   -0.7910    0.3256  )
(   -24   -0.7940    0.3013  )
(   -23   -0.8050    0.2762  )
(   -22   -0.8210    0.2506  )
(   -21   -0.8430    0.2246  )
(   -20   -0.8690    0.1983  )
(   -19   -0.8990    0.1720  )
(   -18   -0.9310    0.1457  )
(   -17   -0.9640    0.1197  )
(   -16   -0.9990    0.0940  )
(   -15   -1.0330    0.0689  )
( -14.5   -1.0500    0.0567  )
( -12.01  -0.9530    0.0271  )
(   -11   -0.9000    0.0303  )
( -9.98   -0.8270    0.0287  )
( -8.12   -0.5360    0.0124  )
( -7.62   -0.4670    0.0109  )
( -7.11   -0.3930    0.0092  )
(  -6.6   -0.3230    0.0083  )
(  -6.5   -0.3110    0.0089  )
(    -6   -0.2450    0.0082  )
(  -5.5   -0.1780    0.0074  )
(    -5   -0.1130    0.0069  )
(  -4.5   -0.0480    0.0065  )
(    -4    0.0160    0.0063  )
(  -3.5    0.0800    0.0061  )
(    -3    0.1450    0.0058  )
(  -2.5    0.2080    0.0057  )
(    -2    0.2700    0.0057  )
(  -1.5    0.3330    0.0057  )
(    -1    0.3960    0.0057  )
(  -0.5    0.4580    0.0057  )
(     0    0.5210    0.0057  )
(   0.5    0.5830    0.0057  )
(     1    0.6450    0.0058  )
(   1.5    0.7060    0.0058  )
(     2    0.7680    0.0059  )
(   2.5    0.8280    0.0061  )
(     3    0.8880    0.0063  )
(   3.5    0.9480    0.0066  )
(     4    0.9960    0.0071  )
(   4.5    1.0460    0.0079  )
(     5    1.0950    0.0090  )
(   5.5    1.1450    0.0103  )
(     6    1.1920    0.0113  )
(   6.5    1.2390    0.0122  )
(     7    1.2830    0.0131  )
(   7.5    1.3240    0.0139  )
(     8    1.3580    0.0147  )
(   8.5    1.3850    0.0158  )
(     9    1.4030    0.0181  )
(   9.5    1.4010    0.0211  )
(    10    1.3580    0.0255  )
(  10.5    1.3130    0.0301  )
(    11    1.2870    0.0347  )
(  11.5    1.2740    0.0401  )
(    12    1.2720    0.0468  )
(  12.5    1.2730    0.0545  )
(    13    1.2730    0.0633  )
(  13.5    1.2730    0.0722  )
(    14    1.2720    0.0806  )
(  14.5    1.2730    0.0900  )
(    15    1.2750    0.0987  )
(  15.5    1.2810    0.1075  )
(    16    1.2840    0.1170  )
(  16.5    1.2960    0.1270  )
(    17    1.3060    0.1368  )
(  17.5    1.3080    0.1464  )
(    18    1.3080    0.1562  )
(  18.5    1.3080    0.1664  )
(    19    1.3080    0.1770  )
(  19.5    1.3070    0.1878  )
(    20    1.3110    0.1987  )
(  20.5    1.3250    0.2100  )
(    21    1.3240    0.2214  )
(    22    1.2770    0.2499  )
(    23    1.2290    0.2786  )
(    24    1.1820    0.3077  )
(    25    1.1360    0.3371  )
(    26    1.0930    0.3664  )
(    28    1.0170    0.4246  )
(    30    0.9620    0.4813  )
(    32    0.9370    0.5356  )
(    35    0.9470    0.6127  )
(    40    0.9500    0.7396  )
(    45    0.9280    0.8623  )
(    50    0.8840    0.9781  )
(    55    0.8210    1.0846  )
(    60    0.7400    1.1796  )
(    65    0.6460    1.2617  )
(    70    0.5400    1.3297  )
(    75    0.4250    1.3827  )
(    80    0.3040    1.4202  )
(    85    0.1790    1.4423  )
(    90    0.0530    1.4512  )
(    95   -0.0730    1.4480  )
(   100   -0.1980    1.4294  )
(   105   -0.3190    1.3954  )
(   110   -0.4340    1.3464  )
(   115   -0.5410    1.2829  )
(   120   -0.6370    1.2057  )
(   125   -0.7200    1.1157  )
(   130   -0.7870    1.0144  )
(   135   -0.8360    0.9033  )
(   140   -0.8640    0.7845  )
(   145   -0.8690    0.6605  )
(   150   -0.8470    0.5346  )
(   155   -0.7950    0.4103  )
(   160   -0.7110    0.2922  )
(   170   -0.7880    0.0969  )
(   175   -0.3940    0.0334  )
(   180    0.0000    0.0185  )

