offshorewindpark_VentusFlow/constant/NREL15MW_Blade/NREL15MW_foil/DU30_A17
// DU30 airfoil with an aspect ratio of 17. Original -180 to 180deg Cl, Cd, and Cm versus AOA data taken from Appendix A of DOWEC document 10046_009.pdf (numerical values obtained from Koert Lindenburg of ECN).
// Cl and Cd values corrected for rotational stall delay and Cd values corrected using the Viterna method for 0 to 90deg AOA by Jason Jonkman using AirfoilPrep_v2p0.xls.
//    AOA       Cl         Cd
(   -180     0.000     0.0267 )
(   -175     0.274     0.037  )
(   -170     0.547     0.0968 )
(   -160     0.685     0.2876 )
(   -155     0.766     0.4025 )
(   -150     0.816     0.5232 )
(   -145     0.836     0.6454 )
(   -140     0.832     0.7656 )
(   -135     0.804     0.8807 )
(   -130     0.756     0.9882 )
(   -125     0.690     1.0861 )
(   -120     0.609     1.173  )
(   -115     0.515     1.2474 )
(   -110     0.411     1.3084 )
(   -105     0.300     1.3552 )
(   -100     0.182     1.3875 )
(    -95     0.061     1.4048 )
(    -90    -0.061     1.407  )
(    -85    -0.183     1.3941 )
(    -80    -0.302     1.3664 )
(    -75    -0.416     1.324  )
(    -70    -0.523     1.2676 )
(    -65    -0.622     1.1978 )
(    -60    -0.708     1.1156 )
(    -55    -0.781     1.022  )
(    -50    -0.838     0.9187 )
(    -45    -0.877     0.8074 )
(    -40    -0.895     0.6904 )
(    -35    -0.889     0.5703 )
(    -30    -0.858     0.4503 )
(    -25    -0.832     0.3357 )
(    -24    -0.852     0.3147 )
(    -23    -0.882     0.2946 )
(    -22    -0.919     0.2752 )
(    -21    -0.963     0.2566 )
(    -20    -1.013     0.2388 )
(    -19    -1.067     0.2218 )
(    -18    -1.125     0.2056 )
(    -17    -1.185     0.1901 )
(    -16    -1.245     0.1754 )
( -15.25    -1.290     0.1649 )
( -14.24    -1.229     0.1461 )
( -13.24    -1.148     0.1263 )
( -12.22    -1.052     0.1051 )
( -11.22    -0.965     0.0886 )
( -10.19    -0.867     0.074  )
(  -9.70    -0.822     0.0684 )
(  -9.18    -0.769     0.0605 )
(  -8.18    -0.756     0.027  )
(  -7.19    -0.690     0.018  )
(  -6.65    -0.616     0.0166 )
(  -6.13    -0.542     0.0152 )
(  -6.00    -0.525     0.0117 )
(  -5.50    -0.451     0.0105 )
(  -5.00    -0.382     0.0097 )
(  -4.50    -0.314     0.0092 )
(  -4.00    -0.251     0.0091 )
(  -3.50    -0.189     0.0089 )
(  -3.00    -0.120     0.0089 )
(  -2.50    -0.051     0.0088 )
(  -2.00     0.017     0.0088 )
(  -1.50     0.085     0.0088 )
(  -1.00     0.152     0.0088 )
(  -0.50     0.219     0.0088 )
(   0.00     0.288     0.0087 )
(   0.50     0.354     0.0087 )
(   1.00     0.421     0.0088 )
(   1.50     0.487     0.0089 )
(   2.00     0.554     0.009  )
(   2.50     0.619     0.0091 )
(   3.00     0.685     0.0092 )
(   3.50     0.749     0.0093 )
(   4.00     0.815     0.0095 )
(   4.50     0.879     0.0096 )
(   5.00     0.944     0.0097 )
(   5.50     1.008     0.0099 )
(   6.00     1.072     0.0101 )
(   6.50     1.135     0.0103 )
(   7.00     1.197     0.0107 )
(   7.50     1.256     0.0112 )
(   8.00     1.305     0.0125 )
(   9.00     1.390     0.0155 )
(   9.50     1.424     0.0171 )
(  10.00     1.458     0.0192 )
(  10.50     1.488     0.0219 )
(  11.00     1.512     0.0255 )
(  11.50     1.533     0.0307 )
(  12.00     1.549     0.037  )
(  12.50     1.558     0.0452 )
(  13.00     1.470     0.063  )
(  13.50     1.398     0.0784 )
(  14.00     1.354     0.0931 )
(  14.50     1.336     0.1081 )
(  15.00     1.333     0.1239 )
(  15.50     1.326     0.1415 )
(  16.00     1.329     0.1592 )
(  16.50     1.326     0.1743 )
(  17.00     1.321     0.1903 )
(  17.50     1.331     0.2044 )
(  18.00     1.333     0.2186 )
(  18.50     1.340     0.2324 )
(  19.00     1.362     0.2455 )
(  19.50     1.382     0.2584 )
(  20.00     1.398     0.2689 )
(  20.50     1.426     0.2814 )
(  21.00     1.437     0.2943 )
(  22.00     1.418     0.3246 )
(  23.00     1.397     0.3557 )
(  24.00     1.376     0.3875 )
(  25.00     1.354     0.4198 )
(  26.00     1.332     0.4524 )
(  28.00     1.293     0.5183 )
(  30.00     1.265     0.5843 )
(  32.00     1.253     0.6492 )
(  35.00     1.264     0.7438 )
(  40.00     1.258     0.897  )
(  45.00     1.217     1.0402 )
(  50.00     1.146     1.1686 )
(  55.00     1.049     1.2779 )
(  60.00     0.932     1.3647 )
(  65.00     0.799     1.4267 )
(  70.00     0.657     1.4621 )
(  75.00     0.509     1.4708 )
(  80.00     0.362     1.4544 )
(  85.00     0.221     1.4196 )
(  90.00     0.092     1.3938 )
(  95.00    -0.030     1.3943 )
( 100.00    -0.150     1.3798 )
( 105.00    -0.267     1.3504 )
( 110.00    -0.379     1.3063 )
( 115.00    -0.483     1.2481 )
( 120.00    -0.578     1.1763 )
( 125.00    -0.660     1.0919 )
( 130.00    -0.727     0.9962 )
( 135.00    -0.777     0.8906 )
( 140.00    -0.807     0.7771 )
( 145.00    -0.815     0.6581 )
( 150.00    -0.797     0.5364 )
( 155.00    -0.750     0.4157 )
( 160.00    -0.673     0.3000 )
( 170.00    -0.547     0.1051 )
( 175.00    -0.274     0.0388 )
( 180.00     0.000     0.0267 )
