offshorewindpark_VentusFlow/constant/NREL15MW_Blade/NREL15MW_hub_elementData
// axial distance, height, diameter
(0  3   6)
(0  -3  6)