offshorewindpark_VentusFlow/constant/NREL6MW_Blade/NREL6MW_foil/DU21_A17
//DU21 airfoil with an aspect ratio of 17.  Original -180 to 180deg Cl, Cd, and Cm versus AOA data taken from Appendix A of DOWEC document 10046_009.pdf (numerical values obtained from Koert Lindenburg of ECN).
//Cl and Cd values corrected for rotational stall delay and Cd values corrected using the Viterna method for 0 to 90deg AOA by Jason Jonkman using AirfoilPrep_v2p0.xls.				
//	AOA	Cl	Cd	
(	-180	0	0.0185	)
(	-175	0.394	0.0332	)
(	-170	0.788	0.0945	)
(	-160	0.67	0.2809	)
(	-155	0.749	0.3932	)
(	-150	0.797	0.5112	)
(	-145	0.818	0.6309	)
(	-140	0.813	0.7485	)
(	-135	0.786	0.8612	)
(	-130	0.739	0.9665	)
(	-125	0.675	1.0625	)
(	-120	0.596	1.1476	)
(	-115	0.505	1.2206	)
(	-110	0.403	1.2805	)
(	-105	0.294	1.3265	)
(	-100	0.179	1.3582	)
(	-95	0.06	1.3752	)
(	-90	-0.06	1.3774	)
(	-85	-0.179	1.3648	)
(	-80	-0.295	1.3376	)
(	-75	-0.407	1.2962	)
(	-70	-0.512	1.2409	)
(	-65	-0.608	1.1725	)
(	-60	-0.693	1.0919	)
(	-55	-0.764	1.0002	)
(	-50	-0.82	0.899	)
(	-45	-0.857	0.79	)
(	-40	-0.875	0.6754	)
(	-35	-0.869	0.5579	)
(	-30	-0.838	0.4405	)
(	-25	-0.791	0.3256	)
(	-24	-0.794	0.3013	)
(	-23	-0.805	0.2762	)
(	-22	-0.821	0.2506	)
(	-21	-0.843	0.2246	)
(	-20	-0.869	0.1983	)
(	-19	-0.899	0.172	)
(	-18	-0.931	0.1457	)
(	-17	-0.964	0.1197	)
(	-16	-0.999	0.094	)
(	-15	-1.033	0.0689	)
(	-14.5	-1.05	0.0567	)
(	-12.01	-0.953	0.0271	)
(	-11	-0.9	0.0303	)
(	-9.98	-0.827	0.0287	)
(	-8.12	-0.536	0.0124	)
(	-7.62	-0.467	0.0109	)
(	-7.11	-0.393	0.0092	)
(	-6.6	-0.323	0.0083	)
(	-6.5	-0.311	0.0089	)
(	-6	-0.245	0.0082	)
(	-5.5	-0.178	0.0074	)
(	-5	-0.113	0.0069	)
(	-4.5	-0.048	0.0065	)
(	-4	0.016	0.0063	)
(	-3.5	0.08	0.0061	)
(	-3	0.145	0.0058	)
(	-2.5	0.208	0.0057	)
(	-2	0.27	0.0057	)
(	-1.5	0.333	0.0057	)
(	-1	0.396	0.0057	)
(	-0.5	0.458	0.0057	)
(	0	0.521	0.0057	)
(	0.5	0.583	0.0057	)
(	1	0.645	0.0058	)
(	1.5	0.706	0.0058	)
(	2	0.768	0.0059	)
(	2.5	0.828	0.0061	)
(	3	0.888	0.0063	)
(	3.5	0.948	0.0066	)
(	4	0.996	0.0071	)
(	4.5	1.046	0.0079	)
(	5	1.095	0.009	)
(	5.5	1.145	0.0103	)
(	6	1.192	0.0113	)
(	6.5	1.239	0.0122	)
(	7	1.283	0.0131	)
(	7.5	1.324	0.0139	)
(	8	1.358	0.0147	)
(	8.5	1.385	0.0158	)
(	9	1.403	0.0181	)
(	9.5	1.401	0.0211	)
(	10	1.358	0.0255	)
(	10.5	1.313	0.0301	)
(	11	1.287	0.0347	)
(	11.5	1.274	0.0401	)
(	12	1.272	0.0468	)
(	12.5	1.273	0.0545	)
(	13	1.273	0.0633	)
(	13.5	1.273	0.0722	)
(	14	1.272	0.0806	)
(	14.5	1.273	0.09	)
(	15	1.275	0.0987	)
(	15.5	1.281	0.1075	)
(	16	1.284	0.117	)
(	16.5	1.296	0.127	)
(	17	1.306	0.1368	)
(	17.5	1.308	0.1464	)
(	18	1.308	0.1562	)
(	18.5	1.308	0.1664	)
(	19	1.308	0.177	)
(	19.5	1.307	0.1878	)
(	20	1.311	0.1987	)
(	20.5	1.325	0.21	)
(	21	1.324	0.2214	)
(	22	1.277	0.2499	)
(	23	1.229	0.2786	)
(	24	1.182	0.3077	)
(	25	1.136	0.3371	)
(	26	1.093	0.3664	)
(	28	1.017	0.4246	)
(	30	0.962	0.4813	)
(	32	0.937	0.5356	)
(	35	0.947	0.6127	)
(	40	0.95	0.7396	)
(	45	0.928	0.8623	)
(	50	0.884	0.9781	)
(	55	0.821	1.0846	)
(	60	0.74	1.1796	)
(	65	0.646	1.2617	)
(	70	0.54	1.3297	)
(	75	0.425	1.3827	)
(	80	0.304	1.4202	)
(	85	0.179	1.4423	)
(	90	0.053	1.4512	)
(	95	-0.073	1.448	)
(	100	-0.198	1.4294	)
(	105	-0.319	1.3954	)
(	110	-0.434	1.3464	)
(	115	-0.541	1.2829	)
(	120	-0.637	1.2057	)
(	125	-0.72	1.1157	)
(	130	-0.787	1.0144	)
(	135	-0.836	0.9033	)
(	140	-0.864	0.7845	)
(	145	-0.869	0.6605	)
(	150	-0.847	0.5346	)
(	155	-0.795	0.4103	)
(	160	-0.711	0.2922	)
(	170	-0.788	0.0969	)
(	175	-0.394	0.0334	)
(	180	0	0.0185	)

