offshorewindpark_VentusFlow/constant/NREL6MW_Blade/NREL6MW_foil/DU25_A17
//DU25 airfoil with an aspect ratio of 17.  Original -180 to 180deg Cl, Cd, and Cm versus AOA data taken from Appendix A of DOWEC document 10046_009.pdf (numerical values obtained from Koert Lindenburg of ECN).
//Cl and Cd values corrected for rotational stall delay and Cd values corrected using the Viterna method for 0 to 90deg AOA by Jason Jonkman using AirfoilPrep_v2p0.xls.
//	AOA	Cl	Cd	
(	-180	0	0.0202	)
(	-175	0.368	0.0324	)
(	-170	0.735	0.0943	)
(	-160	0.695	0.2848	)
(	-155	0.777	0.4001	)
(	-150	0.828	0.5215	)
(	-145	0.85	0.6447	)
(	-140	0.846	0.766	)
(	-135	0.818	0.8823	)
(	-130	0.771	0.9911	)
(	-125	0.705	1.0905	)
(	-120	0.624	1.1787	)
(	-115	0.53	1.2545	)
(	-110	0.426	1.3168	)
(	-105	0.314	1.365	)
(	-100	0.195	1.3984	)
(	-95	0.073	1.4169	)
(	-90	-0.05	1.4201	)
(	-85	-0.173	1.4081	)
(	-80	-0.294	1.3811	)
(	-75	-0.409	1.3394	)
(	-70	-0.518	1.2833	)
(	-65	-0.617	1.2138	)
(	-60	-0.706	1.1315	)
(	-55	-0.78	1.0378	)
(	-50	-0.839	0.9341	)
(	-45	-0.879	0.8221	)
(	-40	-0.898	0.7042	)
(	-35	-0.893	0.5829	)
(	-30	-0.862	0.4616	)
(	-25	-0.803	0.3441	)
(	-24	-0.792	0.3209	)
(	-23	-0.789	0.2972	)
(	-22	-0.792	0.273	)
(	-21	-0.801	0.2485	)
(	-20	-0.815	0.2237	)
(	-19	-0.833	0.199	)
(	-18	-0.854	0.1743	)
(	-17	-0.879	0.1498	)
(	-16	-0.905	0.1256	)
(	-15	-0.932	0.102	)
(	-14	-0.959	0.0789	)
(	-13	-0.985	0.0567	)
(	-12.01	-0.953	0.0271	)
(	-11	-0.9	0.0303	)
(	-9.98	-0.827	0.0287	)
(	-8.98	-0.753	0.0271	)
(	-8.47	-0.691	0.0264	)
(	-7.45	-0.555	0.0114	)
(	-6.42	-0.413	0.0094	)
(	-5.4	-0.271	0.0086	)
(	-5	-0.22	0.0073	)
(	-4.5	-0.152	0.0071	)
(	-4	-0.084	0.007	)
(	-3.5	-0.018	0.0069	)
(	-3	0.049	0.0068	)
(	-2.5	0.115	0.0068	)
(	-2	0.181	0.0068	)
(	-1.5	0.247	0.0067	)
(	-1	0.312	0.0067	)
(	-0.5	0.377	0.0067	)
(	0	0.444	0.0065	)
(	0.5	0.508	0.0065	)
(	1	0.573	0.0066	)
(	1.5	0.636	0.0067	)
(	2	0.701	0.0068	)
(	2.5	0.765	0.0069	)
(	3	0.827	0.007	)
(	3.5	0.89	0.0071	)
(	4	0.952	0.0073	)
(	4.5	1.013	0.0076	)
(	5	1.062	0.0079	)
(	6	1.161	0.0099	)
(	6.5	1.208	0.0117	)
(	7	1.254	0.0132	)
(	7.5	1.301	0.0143	)
(	8	1.336	0.0153	)
(	8.5	1.369	0.0165	)
(	9	1.4	0.0181	)
(	9.5	1.428	0.0211	)
(	10	1.442	0.0262	)
(	10.5	1.427	0.0336	)
(	11	1.374	0.042	)
(	11.5	1.316	0.0515	)
(	12	1.277	0.0601	)
(	12.5	1.25	0.0693	)
(	13	1.246	0.0785	)
(	13.5	1.247	0.0888	)
(	14	1.256	0.1	)
(	14.5	1.26	0.1108	)
(	15	1.271	0.1219	)
(	15.5	1.281	0.1325	)
(	16	1.289	0.1433	)
(	16.5	1.294	0.1541	)
(	17	1.304	0.1649	)
(	17.5	1.309	0.1754	)
(	18	1.315	0.1845	)
(	18.5	1.32	0.1953	)
(	19	1.33	0.2061	)
(	19.5	1.343	0.217	)
(	20	1.354	0.228	)
(	20.5	1.359	0.239	)
(	21	1.36	0.2536	)
(	22	1.325	0.2814	)
(	23	1.288	0.3098	)
(	24	1.251	0.3386	)
(	25	1.215	0.3678	)
(	26	1.181	0.3972	)
(	28	1.12	0.4563	)
(	30	1.076	0.5149	)
(	32	1.056	0.572	)
(	35	1.066	0.6548	)
(	40	1.064	0.7901	)
(	45	1.035	0.919	)
(	50	0.98	1.0378	)
(	55	0.904	1.1434	)
(	60	0.81	1.2333	)
(	65	0.702	1.3055	)
(	70	0.582	1.3587	)
(	75	0.456	1.3922	)
(	80	0.326	1.4063	)
(	85	0.197	1.4042	)
(	90	0.072	1.3985	)
(	95	-0.05	1.3973	)
(	100	-0.17	1.381	)
(	105	-0.287	1.3498	)
(	110	-0.399	1.3041	)
(	115	-0.502	1.2442	)
(	120	-0.596	1.1709	)
(	125	-0.677	1.0852	)
(	130	-0.743	0.9883	)
(	135	-0.792	0.8818	)
(	140	-0.821	0.7676	)
(	145	-0.826	0.6481	)
(	150	-0.806	0.5264	)
(	155	-0.758	0.406	)
(	160	-0.679	0.2912	)
(	170	-0.735	0.0995	)
(	175	-0.368	0.0356	)
(	180	0	0.0202	)

