offshorewindpark_VentusFlow/constant/NREL6MW_Blade/NREL6MW_hub_elementData
// axial distance, height, diameter
(0  1.5    3)
(0  -1.5    3)