offshorewindpark_VentusFlow/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  v2212
|   \  /    A nd           | Website:  www.openfoam.com
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/initialConditions"

Turbine_1
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             WakeRegion_1;
        origin              (169.85221701464616 -191.01540861930698 102);
        axis                $axisInitial;
        verticalDirection   (0 0 1);
        freeStreamVelocity  $UInitial;
        tipSpeedRatio       6.8;
        inductionFactor     0.25;
        rotorRadius         77;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          on;
            endEffectsModel shen;
            GlauertCoeffs
            {
                tipEffects  on;
                rootEffects on;
            }
            ShenCoeffs
            {
                tipEffects  on;
                rootEffects on;
                c1          0.125;
                c2          21;
            }
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                nElements           17;
                elementProfiles
                (
                    #include "NREL6MW_Blade/NREL6MW_17_elementProfiles"
                );
                elementData
                (
                    #include "NREL6MW_Blade/NREL6MW_17_elementData"
                );
                collectivePitch     0.0;
            }
            blade2
            {
                $blade1;
                writePerf           false;
                writeElementPerf    false;
                azimuthalOffset     120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset     240.0;
            }
        }
    
        tower
        {
            includeInTotalDrag  false;
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (// axial distance (turbine axis), height, diameter
                (10.0 -102 4.50)
                (10.0   0.0 3.50)
            );
        }
        hub
        {
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (
            #include "NREL6MW_Blade/NREL6MW_hub_elementData"
            );
        }
        profileData
        {
            DU99W405LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/DU40_A17"
                );
            }
            DU99W350LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/DU35_A17"
                );
            }
            DU97W300LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/DU30_A17"
                );
            }
            DU91W2250LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/DU25_A17"
                );
            }
            DU93W210LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/DU21_A17"
                );
            }
            NACA64618
            {
                tableType   singleRe;
                data
                (
                #include "NREL6MW_Blade/NREL6MW_foil/NACA64_A17"
                );
            }
            circular050
            {
                data ((-180 0 0.50)(180 0 0.50));
            }
            circular035
            {
                data ((-180 0 0.35)(180 0 0.35));
            }
            cylinder
            {
                data ((-180 0 0.0)(180 0 0.0));
            }
        }
    }
}
Turbine_2
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             WakeRegion_1;
        origin              (432.31747192388866 130.46229293756187 120);
        axis                $axisInitial;
        verticalDirection   (0 0 1);
        freeStreamVelocity  $UInitial;
        tipSpeedRatio       8.5;
        inductionFactor     0.25;
        rotorRadius         110;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          on;
            endEffectsModel shen;
            GlauertCoeffs
            {
                tipEffects  on;
                rootEffects on;
            }
            ShenCoeffs
            {
                tipEffects  on;
                rootEffects on;
                c1          0.125;
                c2          21;
            }
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                nElements           17;
                elementProfiles
                (
                    #include "NREL15MW_Blade/NREL15MW_17_elementProfiles"
                );
                elementData
                (
                    #include "NREL15MW_Blade/NREL15MW_17_elementData"
                );
                collectivePitch     0.0;
            }
            blade2
            {
                $blade1;
                writePerf           false;
                writeElementPerf    false;
                azimuthalOffset     120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset     240.0;
            }
        }
    
        tower
        {
            includeInTotalDrag  false;
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (// axial distance (turbine axis), height, diameter
                (10.0 -120 4.50)
                (10.0   0.0 3.50)
            );
        }
        hub
        {
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (
            #include "NREL15MW_Blade/NREL15MW_hub_elementData"
            );
        }
        profileData
        {
            DU99W405LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU40_A17"
                );
            }
            DU99W350LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU35_A17"
                );
            }
            DU97W300LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU30_A17"
                );
            }
            DU91W2250LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU25_A17"
                );
            }
            DU93W210LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU21_A17"
                );
            }
            NACA64618
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/NACA64_A17"
                );
            }
            circular050
            {
                data ((-180 0 0.50)(180 0 0.50));
            }
            circular035
            {
                data ((-180 0 0.35)(180 0 0.35));
            }
            cylinder
            {
                data ((-180 0 0.0)(180 0 0.0));
            }
        }
    }
}
Turbine_3
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             WakeRegion_1;
        origin              (432.31747192388866 130.46229293756187 120);
        axis                $axisInitial;
        verticalDirection   (0 0 1);
        freeStreamVelocity  $UInitial;
        tipSpeedRatio       8.5;
        inductionFactor     0.25;
        rotorRadius         110;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          on;
            endEffectsModel shen;
            GlauertCoeffs
            {
                tipEffects  on;
                rootEffects on;
            }
            ShenCoeffs
            {
                tipEffects  on;
                rootEffects on;
                c1          0.125;
                c2          21;
            }
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                nElements           17;
                elementProfiles
                (
                    #include "NREL15MW_Blade/NREL15MW_17_elementProfiles"
                );
                elementData
                (
                    #include "NREL15MW_Blade/NREL15MW_17_elementData"
                );
                collectivePitch     0.0;
            }
            blade2
            {
                $blade1;
                writePerf           false;
                writeElementPerf    false;
                azimuthalOffset     120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset     240.0;
            }
        }
    
        tower
        {
            includeInTotalDrag  false;
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (// axial distance (turbine axis), height, diameter
                (10.0 -120 4.50)
                (10.0   0.0 3.50)
            );
        }
        hub
        {
            nElements           2;
            elementProfiles     (cylinder);
            elementData
            (
            #include "NREL15MW_Blade/NREL15MW_hub_elementData"
            );
        }
        profileData
        {
            DU99W405LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU40_A17"
                );
            }
            DU99W350LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU35_A17"
                );
            }
            DU97W300LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU30_A17"
                );
            }
            DU91W2250LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU25_A17"
                );
            }
            DU93W210LM
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/DU21_A17"
                );
            }
            NACA64618
            {
                tableType   singleRe;
                data
                (
                #include "NREL15MW_Blade/NREL15MW_foil/NACA64_A17"
                );
            }
            circular050
            {
                data ((-180 0 0.50)(180 0 0.50));
            }
            circular035
            {
                data ((-180 0 0.35)(180 0 0.35));
            }
            cylinder
            {
                data ((-180 0 0.0)(180 0 0.0));
            }
        }
    }
}
