offshorewindpark_VentusFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2212                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

xMin -736.0;
xMax 736.0;
yMin -416.0;
yMax 416.0;
zMin 0;
zMax 1024.0;

xElem 23;
yElem 13;
zElem 16;

vertices
(
    ($xMin $yMin $zMin) // 0
    ($xMax $yMin $zMin) // 1
    ($xMax $yMax $zMin) // 2
    ($xMin $yMax $zMin) // 3
    ($xMin $yMin $zMax) // 4
    ($xMax $yMin $zMax) // 5
    ($xMax $yMax $zMax) // 6
    ($xMin $yMax $zMax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (23 13 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 3 4 7)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (1 2 5 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    side1
    {
        type cyclic;
        neighbourPatch  side2;
        faces
        (
            (0 1 4 5)
        );
    }

    side2
    {
        type cyclic;
        neighbourPatch  side1;
        faces
        (
            (2 3 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
