offshorewindpark_VentusFlow/system/refineMeshDict.refine2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}

// ************************************************************************* //

set             refineRegion2;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2            ( 0 1 0 );
}

directions
(
    tan1
    tan2
    normal
);

useHexTopology  yes;
geometricCut    no;
writeMesh       no;
// ************************************************************************* //
