offshorewindpark_VentusFlow/system/sampleSliceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleSlice;
}

// ************************************************************************* //

interpolationScheme cellPoint;

setFormat vtk;

sets
(
    hubSlice
    {
        type        cuttingPlane;
        planeType   pointAndNormal;
        pointAndNormalDict
        {
            basePoint   (0 0 102);
            normalVector (0 0 1);
        }
        interpolate true;
        fields      (U p);
    }
);

// ************************************************************************* //
