offshorewindpark_VentusFlow/system/topoSetDict.refine3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// ************************************************************************* //

actions
(
    {
        name        refineH3;
        type        cellSet;
        action      new;
        source      boxToCell;
        box (-736.0 -416.0 0) (736.0 416.0 340);
    }
);
// ************************************************************************* //
