offshorewindpark_VentusFlow/system/writeRegisteredObject
writeRegisteredObject
{
    enabled             false;
    type                writeObjects;
    libs                ("libutilityFunctionObjects.so");
    writeControl    	adjustableRunTime;
    writeInterval       10.0;
    objects             (U);
}
